app/Http/Controllers/PetOwner/DashboardController.php

    public function index()
    {
        $user = auth()->user();

        // Get pets
        $pets = Pet::where('user_id', $user->id)
                   ->latest()
                   ->get();

        // Get appointments
        $appointments = $user->appointments ?? collect();

        // Get products
        $products = Product::query()
            ->select('id', 'name', 'selling_price as price', 'quantity as stock', 'product_image')
            ->latest()
            ->take(2)
            ->get()
            ->map(function ($product) {
                $product->image_url = $product->product_image ?
                    asset('storage/' . $product->product_image) :
                    asset('storage/defaults/no-image.jpg');
                return $product;
            });

        // Get messages
        $unreadMessagesCount = Message::whereRaw('JSON_CONTAINS(receivers, ?)', [json_encode(['id' => auth()->id()])])
            ->whereNull('read_at')
            ->count();

        $latestMessage = Message::where(function($query) use ($user) {
                $query->whereRaw('JSON_CONTAINS(receivers, ?)', [json_encode(['id' => $user->id])])
                      ->orWhere('sender_id', $user->id);
            })
            ->latest()
            ->first();
---
select * from `pets` where `pets`.`user_id` = 108 and `pets`.`user_id` is not null and `pets`.`deleted_at` is null
select `id`, `name`, `selling_price`, `quantity`, `product_image` from `products` order by `created_at` desc limit 2
select * from `messages` where `receiver_id` = 108 or `sender_id` = 108 order by `created_at` desc limit 1