app/Http/Controllers/PetOwner/MessagesController.php

    public function show($conversationId)
    {
        $cacheKey = 'messages_' . auth()->id();

        return Cache::remember($cacheKey, now()->addSeconds(30), function () {
            // Get the first admin as default receiver
            $admin = User::where('role', 'admin')->first();
            if (!$admin) {
                abort(404, 'No admin found to handle messages');
            }

            // Get or create a single conversation
            $conversation = Conversation::firstOrCreate(
                ['pet_owner_id' => auth()->id()],
                [
                    'unique_key' => Conversation::generateUniqueKey(),
                    'admin_id' => $admin->id
                ]
            );

            // Get messages with caching
            $messages = Cache::remember(
                'conversation_' . $conversation->id,
                now()->addSeconds(30),
                function () use ($conversation) {
                    return Message::where(function($query) use ($conversation) {
                        $query->where('conversation_id', $conversation->id)
                              ->orWhere(function($q) use ($conversation) {
                                  $q->whereRaw('JSON_CONTAINS(receivers, ?)', [json_encode(['id' => $conversation->pet_owner_id])])
                                    ->orWhereRaw('JSON_CONTAINS(receivers, ?)', [json_encode(['id' => $conversation->admin_id])]);
                              });
                    })
                    ->with(['sender'])
                    ->orderBy('created_at')
                    ->get();
                }
            );
---
select * from `users` where `role` = 'admin' and `users`.`deleted_at` is null limit 1
select * from `conversations` where (`pet_owner_id` = 108) limit 1
select * from `messages` where (`conversation_id` = 2 or (`conversation_id` is null and (`sender_id` = 108 or `sender_id` = 1) and (`receiver_id` = 108 or `receiver_id` = 1))) order by `created_at` asc