app/Http/Controllers/PetOwner/PetController.php

    public function index()
    {
        $pets = auth()->user()->pets()->latest()->get();
---
select * from `pets` where `pets`.`user_id` = 108 and `pets`.`user_id` is not null and `pets`.`deleted_at` is null order by `created_at` desc