app/Http/Controllers/Dashboards/DashboardController.php

    public function index(Request $request)
    {
        $totalPets = Pet::count();
        $todayPets = Pet::whereDate('created_at', today())->count();

        $appointments = Appointment::count();
        $todayAppointments = Appointment::whereDate('created_at', today())->count();

        \Log::info('Dashboard Counts:', [
            'total_pets' => $totalPets,
            'today_pets' => $todayPets,
            'total_appointments' => $appointments,
            'today_appointments' => $todayAppointments
        ]);

        $orders = Order::where("user_id", auth()->id())->count();
        $products = Product::where("user_id", auth()->id())->count();
        $todayProducts = Product::whereDate('created_at', today())->count();
        $todayOrders = Order::whereDate('created_at', today())->count();
        $categories = Category::where("user_id", auth()->id())->count();
        $totalPetOwners = User::where('role', 'pet_owner')->count();
        $todayPetOwners = User::where('role', 'pet_owner')->whereDate('created_at', today())->count();
---
select count(*) as aggregate from `pets` where `pets`.`deleted_at` is null
select count(*) as aggregate from `pets` where date(`created_at`) = '2025-01-29' and `pets`.`deleted_at` is null
select count(*) as aggregate from `appointment` where `appointment`.`deleted_at` is null
select count(*) as aggregate from `appointment` where date(`created_at`) = '2025-01-29' and `appointment`.`deleted_at` is null
select count(*) as aggregate from `orders` where `user_id` = 1 and `orders`.`deleted_at` is null
select count(*) as aggregate from `products` where `user_id` = 1
select count(*) as aggregate from `products` where date(`created_at`) = '2025-01-29'
select count(*) as aggregate from `orders` where date(`created_at`) = '2025-01-29' and `orders`.`deleted_at` is null
select count(*) as aggregate from `categories` where `user_id` = 1
select count(*) as aggregate from `users` where `role` = 'pet_owner' and `users`.`deleted_at` is null
select count(*) as aggregate from `users` where `role` = 'pet_owner' and date(`created_at`) = '2025-01-29' and `users`.`deleted_at` is null

        $recentEvents = $this->getRecentEvents($fromDate, $toDate, $sortBy);

        // Calculate growth percentages
        $lastMonthPets = Pet::whereMonth('created_at', now()->subMonth()->month)
            ->whereYear('created_at', now()->subMonth()->year)
            ->count();
        $petGrowth = $lastMonthPets > 0 ? (($totalPets - $lastMonthPets) / $lastMonthPets) * 100 : 0;

        // Calculate appointment growth
        $lastMonthAppointments = Appointment::whereMonth('created_at', now()->subMonth()->month)
            ->whereYear('created_at', now()->subMonth()->year)
            ->count();
---
select count(*) as aggregate from `pets` where month(`created_at`) = '12' and year(`created_at`) = 2024 and `pets`.`deleted_at` is null
select count(*) as aggregate from `appointment` where month(`created_at`) = '12' and year(`created_at`) = 2024 and `appointment`.`deleted_at` is null

            ? (($appointments - $lastMonthAppointments) / $lastMonthAppointments) * 100
            : 0;

        $averageOrders = Order::whereDate('created_at', '>=', now()->subDays(30))
            ->whereDate('created_at', '<', today())
            ->count() / 30;
---
select count(*) as aggregate from `orders` where date(`created_at`) >= '2024-12-30' and date(`created_at`) < '2025-01-29' and `orders`.`deleted_at` is null

        $ownerGrowth = $todayPetOwners > 0 ? (($totalPetOwners - $todayPetOwners) / $todayPetOwners) * 100 : 0;

        // Format appointments for calendar
        $calendarAppointments = Appointment::select(
            'id',
            'appointment_date as start',
            'reason_for_visit as title',
            'appointment_time',
            'owner_name',
            'pet_name',
            DB::raw("CONCAT(
                'Owner: ', owner_name,
                '\nPet: ', COALESCE(pet_name, 'Not specified'),
                '\nTime: ', TIME_FORMAT(appointment_time, '%h:%i %p'),
                '\nReason: ', reason_for_visit
            ) as description")
        )->get()->map(function($appointment) {
            return [
                'id' => $appointment->id,
                'title' => $appointment->title,
                'start' => $appointment->start,
                'description' => $appointment->description,
                'backgroundColor' => '#3788d8',
                'borderColor' => '#3788d8',
                'textColor' => '#ffffff',
---
select `id`, `appointment_date` as `start`, `reason_for_visit` as `title`, `appointment_time`, `owner_name`, `pet_name`, CONCAT(
'Owner: ', owner_name,
'
Pet: ', COALESCE(pet_name, 'Not specified'),
'
Time: ', TIME_FORMAT(appointment_time, '%h:%i %p'),
'
Reason: ', reason_for_visit
) as description from `appointment` where `appointment`.`deleted_at` is null

    private function getMonthlyStats()
    {
        $months = collect(range(1, 12))->map(function($month) {
            $date = now()->month($month);
            return [
                'month' => $date->format('M'),
                'appointments' => Appointment::whereMonth('created_at', $month)
                    ->whereYear('created_at', now()->year)
                    ->count(),
                'pets' => Pet::whereMonth('created_at', $month)
                    ->whereYear('created_at', now()->year)
                    ->count(),
                'orders' => Order::whereMonth('created_at', $month)
                    ->whereYear('created_at', now()->year)
                    ->count(),
                'petOwners' => User::where('role', 'pet_owner')
                    ->whereMonth('created_at', $month)
                    ->whereYear('created_at', now()->year)
                    ->count(),
---
select count(*) as aggregate from `appointment` where month(`created_at`) = '01' and year(`created_at`) = 2025 and `appointment`.`deleted_at` is null
select count(*) as aggregate from `pets` where month(`created_at`) = '01' and year(`created_at`) = 2025 and `pets`.`deleted_at` is null
select count(*) as aggregate from `orders` where month(`created_at`) = '01' and year(`created_at`) = 2025 and `orders`.`deleted_at` is null
select count(*) as aggregate from `users` where `role` = 'pet_owner' and month(`created_at`) = '01' and year(`created_at`) = 2025 and `users`.`deleted_at` is null