app/Http/Controllers/Dashboards/DashboardController.php

select count(*) as aggregate from `orders` where `user_id` = 1
select count(*) as aggregate from `products` where `user_id` = 1
select count(*) as aggregate from `purchases` where `user_id` = 1
select count(*) as aggregate from `purchases` where date(`date`) = '2024-09-02'
select count(*) as aggregate from `quotations` where date(`created_at`) = '2024-09-02'
select count(*) as aggregate from `quotations` where `user_id` = 1
---
    public function index()
    {
        $orders = Order::where("user_id", auth()->id())->count();
        $products = Product::where("user_id", auth()->id())->count();

        $purchases = Purchase::where("user_id", auth()->id())->count();
        $todayPurchases = Purchase::whereDate('date', today()->format('Y-m-d'))->count();
        $todayProducts = Product::whereDate('created_at', today()->format('Y-m-d'))->count();
        $todayQuotations = Quotation::whereDate('created_at', today()->format('Y-m-d'))->count();
        $todayOrders = Order::whereDate('created_at', today()->format('Y-m-d'))->count();

        $categories = Category::where("user_id", auth()->id())->count();
        $quotations = Quotation::where("user_id", auth()->id())->count();