app/Http/Controllers/CategoryController.php

select count(*) as aggregate from `categories` where `user_id` = 1
---
    public function index()
    {
        $categories = Category::where("user_id", auth()->id())->count();