app/Http/Controllers/MessageController.php

    public function index()
    {
        // List all pet owners
        $users = User::where('role', 'pet_owner')->get();
---
select * from `users` where `role` = 'pet_owner' and `users`.`deleted_at` is null