app/Http/Controllers/NotificationsController.php

select * from `products` where `quantity` <= quantity_alert
select * from `products` where `expiry_date` <= '2025-02-28 03:04:27'
select * from `appointment` where `scheduled_at` >= '2025-01-29 03:04:27' and `scheduled_at` <= '2025-02-05 03:04:27' and `status` != 'completed' and `status` != 'cancelled' and `appointment`.`deleted_at` is null order by `scheduled_at` asc
---
    public function index()
    {
        // Add debugging
        \Log::info('Notifications controller hit');

        $notifications = Product::where('quantity', '<=', DB::raw('quantity_alert'))->get();
        \Log::info('Notifications count: ' . $notifications->count());

        $expiringProducts = Product::where('expiry_date', '<=', now()->addDays(30))->get();
        \Log::info('Expiring products count: ' . $expiringProducts->count());

        $upcomingAppointments = Appointment::where('scheduled_at', '>=', now())
            ->where('scheduled_at', '<=', now()->addWeek())
            ->where('status', '!=', 'completed')
            ->where('status', '!=', 'cancelled')
            ->orderBy('scheduled_at')
            ->get();