app/Http/Controllers/PagesController.php

    public function index()
    {
        // Get counts for the dashboard cards
        $data = [
            'suppliers' => Supplier::where('user_id', auth()->id())->count(),
            'categories' => Category::where('user_id', auth()->id())->count(),
            'units' => Unit::where('user_id', auth()->id())->count(),
        ];
---
select count(*) as aggregate from `suppliers` where `user_id` = 1
select count(*) as aggregate from `categories` where `user_id` = 1
select count(*) as aggregate from `units` where `user_id` = 1