app/Http/Controllers/PetController.php

    public function index()
    {
        // Fetch all pets with their associated users
        $pets = Pet::with(['appointments' => function($query) {
            $query->orderBy('appointment_date', 'desc');
        }, 'user'])->get();
---
select * from `appointment` where `appointment`.`pet_id` in (5, 6, 7, 8, 9) and `appointment`.`deleted_at` is null order by `appointment_date` desc
select * from `users` where `users`.`id` in (3, 108, 110) and `users`.`deleted_at` is null

    public function create()
    {
        // Fetch all users for the dropdown
        $users = User::all();
---
select * from `users` where `users`.`deleted_at` is null

    public function destroy(Pet $pet)
    {
        if ($pet->photo) {
            Storage::disk('public')->delete($pet->photo);
        }

        $pet->deleted_by = auth()->id();
        $pet->save();

        $pet->delete();
---
update `pets` set `deleted_by` = 1, `pets`.`updated_at` = '2025-01-29 13:56:32' where `id` = 11

    public function restore($id)
    {
        try {
            $pet = Pet::withTrashed()->findOrFail($id);
            $pet->restore();
---
update `pets` set `deleted_at` = '2025-01-29 13:56:32', `pets`.`updated_at` = '2025-01-29 13:56:32' where `id` = 11