app/Http/Controllers/UserController.php

    public function edit($id)
    {
        $user = User::findOrFail($id);
---
select * from `users` where `users`.`id` = '108' and `users`.`deleted_at` is null limit 1