app/Models/Pet.php

    public static function getTotalCount()
    {
        return self::count();
---
select count(*) as aggregate from `pets` where date(`created_at`) = '2025-01-29' and `pets`.`deleted_at` is null